//
//  favoriteFilms.swift
//  assignment8
//
//  Created by Kaisar Kassymkhanov on 11.11.2024.
//

struct favoriteFilmsTests {
    let favoritsFilms: [Films] = [
        Films(title: "Начало", image: "inception", description: """
              Доминик Кобб - талантливый вор, лучший в опасном искусстве извлечения: похищения ценных секретов из глубин подсознания во время сна. Редкие способности Кобба сделали его ценным игроком в предательном мире промышленного шпионажа, но они же превратили его в вечного беглеца.
              """, rating: 8.8, favorite: false),
        Films(title: "Довод", image: "tenet", description: """
          Вооруженный одним словом — Довод — и понимая, что только он может предотвратить мировую катастрофу, главный герой вынужден пересекать и ломать законы времени, чтобы спасти мир.
          """, rating: 7.8, favorite: false),
        Films(title: "Матрица", image: "matrix", description: """
    Компьютерный хакер Томас Андерсон под кодовым именем Нео узнаёт, что реальность, в которой он живёт, на самом деле — симуляция. Он присоединяется к группе повстанцев, чтобы сразиться против машин.
    """, rating: 8.7, favorite: false),
        Films(title: "Криминальное чтиво", image: "pulpFiction", description: """
    Два гангстера, Винсент Вега и Джулс Винфилд, погружаются в серию событий, где переплетаются комические и трагические моменты, которые заставляют их пересмотреть свои взгляды на жизнь.
    """, rating: 8.9, favorite: false),
        Films(title: "Темный рыцарь", image: "darkKnight", description: """
    Брюс Уэйн, в образе Бэтмена, противостоит безумному гению по имени Джокер, который сеет хаос в Готэме, подвергая горожан опасности.
    """, rating: 9.0, favorite: false),
        Films(title: "Гладиатор", image: "gladiator", description: """
    Полководец Максимус, преданный и проданный в рабство, становится гладиатором, чтобы отомстить за смерть своей семьи и воздать справедливость предателю императору Коммоду.
    """, rating: 8.5, favorite: false),
        Films(title: "Терминатор 2: Судный день", image: "terminator2", description: """
    Киборг из будущего возвращается, чтобы защитить Джона Коннора, мальчика, который станет лидером сопротивления, от нового, более совершенного киборга.
    """, rating: 8.6, favorite: false),
        Films(title: "Властелин колец: Возвращение короля", image: "lordOfTheRings", description: """
    Финальная битва Средиземья приближается, и Фродо с Сэмом продолжают путь к Ородруину, чтобы уничтожить Кольцо Всевластья и спасти мир от Саурона.
    """, rating: 9.0, favorite: false),
        Films(title: "Звездные войны: Империя наносит ответный удар", image: "starWars", description: """
    Люк Скайуокер, принцесса Лея и Хан Соло продолжают сражаться с Империей, но на пути у Люка встаёт ужасная правда о его происхождении.
    """, rating: 8.7, favorite: false),
        Films(title: "Хоббит: Нежданное путешествие", image: "hobbit", description: """
    Молодой хоббит по имени Бильбо отправляется в путешествие вместе с гномами и волшебником Гэндальфом, чтобы вернуть королевство Эребор от дракона Смога.
    """, rating: 7.8, favorite: false)]
}

